In [4]:
import pandas as pd
import numpy as np

transactions = {"transaction_id" : [1, 2, 3, 4, 5], "product_id" : [101, 102, 103, 104, 105], "amount" : [3, 5, 8, 3, 2]}
products = {"product_id" : [101, 102, 103, 104, 105], "price" : [20.00, 21.00, 15.00, 16.00, 52.00]}
df_transactions = pd.DataFrame(transactions)

df_products = pd.DataFrame(products)
# df_concat = pd.merge('df_transactions','df_products',on='product_id')
# print(df_concat)

In [8]:
df = pd.merge(df_transactions,df_products,how='left',on='product_id')
df['total_value'] = df['amount'] * df['price']

   transaction_id  product_id  amount  price
0               1         101       3   20.0
1               2         102       5   21.0
2               3         103       8   15.0
3               4         104       3   16.0
4               5         105       2   52.0

In [22]:
import pandas as pd

addresses = {"address": ["4860 Sunset Boulevard, San Francisco, 94105", "3055 Paradise Lane, Salt Lake City, 84103", "682 Main Street, Detroit, 48204", "9001 Cascade Road, Kansas City, 64102", "5853 Leon Street, Tampa, 33605"]}

cities = {"city": ["Salt Lake City", "Kansas City", "Detroit", "Tampa", "San Francisco"], "state": ["Utah", "Missouri", "Michigan", "Florida", "California"]}

df_addresses = pd.DataFrame(addresses)
df_cities = pd.DataFrame(cities)
df_addresses[['city_name','city','street no']] = df_addresses['address'].str.split(',',expand=True)
df_addresses

,address,city_name,city,street no
0,"4860 Sunset Boulevard, San Francisco, 94105",4860 Sunset Boulevard,San Francisco,94105
1,"3055 Paradise Lane, Salt Lake City, 84103",3055 Paradise Lane,Salt Lake City,84103
2,"682 Main Street, Detroit, 48204",682 Main Street,Detroit,48204
3,"9001 Cascade Road, Kansas City, 64102",9001 Cascade Road,Kansas City,64102
4,"5853 Leon Street, Tampa, 33605",5853 Leon Street,Tampa,33605

In [21]:
df_addresses.drop('address',axis=1,inplace=True)
df_merged = pd.merge(df_addresses, df_cities,how='left',on='city')

In [ ]:
ls = ['as','as','r','ss', 'as', 'r', 'sa']
for i in ls:
    d[i] = d.get(i,0) + 1